# Pandas cheat code

## Introduction
The objective of this knowledge post is to save time and increase code quality by offering an alternative to Pandas documentation and Stake Overflow in the form of a Jupyter Notebook with the following features:

- Pandas key data transformation easy to copy-past code snippets
- Embedded data for easy snippets run and testing
- Alteryx nodes to Pandas functions mapping

## How to leverage it
- you can run and test any function with embedded data, just make sure to load the data first ;)
- you can easily copy-past snippet of codes by **double clicking** on a cell, right click and copy-paste

Contents

### 1. Getting started

The first time you use this notebook, run once the pip install libraries (in case not already installed on your Python environment)

#### 1.1. Setup libraries

In [24]:
!pip install pandas
!pip install openpyxl

Requirement already satisfied: pandas in c:\users\serge louvet\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\serge louvet\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\serge louvet\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\serge louvet\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in c:\users\serge louvet\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Requirement already satisfied: openpyxl in c:\users\serge louvet\anaconda3\lib\site-packages (3.0.7)
Requirement already satisfied: et-xmlfile in c:\users\serge louvet\anaconda3\lib\site-packages (from openpyxl) (1.0.1)

In [25]:
import pandas as pd

#### 1.2. About pandas dataframes

A pandas dataframe contains an array, a list of column names (the column index) and a list of row names (the row index) In many cases, an entry in the column index is the name of the column and the row index is the row number.  Some operations on dataframes affect the row index, so the name of the row is no longer a row number. We will see how to fix that in xx.xx.

### 2. Read data (inputdata)
https://pandas.pydata.org/docs/user_guide/io.html

<div class="alert alert-block alert-danger">
Make sure to load the datasets before running any other snippets of code ;)
    </div>

#### 2.1. Load text file (.csv, .txt, ...)

Transfer the content of a file to a dataframe and get basic information about the loaded dataset.

In [56]:
#
# read a comma separated file
#
transactions = pd.read_csv('data_input/transactions.csv', sep=',')

#
# read a tab separated file
#
customers_1 = pd.read_csv('data_input/customers.txt', sep='\t')

# note that the phone numbers are loosing their leading zeroes:
print(customers_1)

      customer_id   customer_name  phone_nbr country       city
0   Customer ID 7  customer_seven     321234      BE  Bruxelles
1   Customer ID 1    customer_one       5678      BE  Bruxelles
2   Customer ID 8  customer_eight        123      BE      Wavre
3   Customer ID 3  customer_three        441      BE      Lille
4  Customer ID 10    customer_ten     329086      BE      Namur
5   Customer ID 2    customer_two       9812      BE  Charleroi
6   Customer ID 6    customer_six       6413      FR      Paris
7   Customer ID 9   customer_nine     338792      FR      Lille
8   Customer ID 4   customer_four       4392      FR    Roubaix
9   Customer ID 5   customer_five       4724      FR     Toulon

In [57]:
#
# we need to prevent pandas to convert loaded text to a numeric field type
#
# read a text file (here a tab separated file) and force all fields to string
#
customers = pd.read_csv('data_input/customers.txt', sep='\t', dtype='str')
print(customers)

      customer_id   customer_name phone_nbr country       city
0   Customer ID 7  customer_seven  00321234      BE  Bruxelles
1   Customer ID 1    customer_one      5678      BE  Bruxelles
2   Customer ID 8  customer_eight      0123      BE      Wavre
3   Customer ID 3  customer_three      0441      BE      Lille
4  Customer ID 10    customer_ten  00329086      BE      Namur
5   Customer ID 2    customer_two      9812      BE  Charleroi
6   Customer ID 6    customer_six      6413      FR      Paris
7   Customer ID 9   customer_nine  00338792      FR      Lille
8   Customer ID 4   customer_four      4392      FR    Roubaix
9   Customer ID 5   customer_five      4724      FR     Toulon

#### 2.2. Load xlsx

Pandas uses openpyxl to load a dataset from a sheet.

In [28]:
costs = pd.read_excel('data_input/costs.xlsx', sheet_name='Sheet1')

#### 2.3 Get basic information about the loaded dataset

Get the number of rows, number of columns and list of column names

In [29]:

print(f"Nomber of rows: {customers.shape[0]}")
print(f"Nomber of columns: {customers.shape[1]}")
print("Columns:", customers.columns)

Nomber of rows: 10
Nomber of columns: 4
Columns: Index(['customer_id', 'customer_name', 'phone_nbr', 'country'], dtype='object')

### 3. Explore data (browse)
https://pandas.pydata.org/docs/user_guide/basics.html

#### 3.1. Remove column number display limitation

In [30]:
pd.set_option('display.max_columns', None)

#### 3.2. Display top n rows

In [31]:
transactions.head(n=5)

,row_id,transaction_date,customer_id,customer_level_2,product_id,product_level_2,geo,bu,volume,list_price,gross_sale,discount_placeholder,net_sale,other_ancillary_charge,freight_billed,payment_term_discount,off_invoice_discount,pocket_sale,cogs,other_cogs_adjustement,gross_margin,net_sale_gross_margin,freight_cost,other_cost_to_serve,net_margin
0,1,2019-06-04,Customer ID 7,Customer group 2,Product ID 9,Product group 2,Italy,BU 2,0.24,15.05,3.68,0.07,3.61,-0.08,0.00,0.06,0.03,3.61,2.52,0.09,1.00,1.01,0.03,0.12,0.86
1,2,2019-08-31,Customer ID 1,Customer group 1,Product ID 1,Product group 1,Spain,BU 2,75.27,12.67,953.67,3.53,950.13,-36.74,-20.02,21.87,35.41,949.62,782.85,25.05,141.72,142.24,16.52,5.27,120.45
2,3,2019-01-18,Customer ID 8,Customer group 2,Product ID 3,Product group 1,France,BU 2,49.10,14.18,696.44,19.71,676.73,-3.01,-11.93,24.14,20.24,647.29,514.16,1.76,131.37,160.81,18.06,12.84,129.91
3,4,2019-05-09,Customer ID 1,Customer group 1,Product ID 6,Product group 2,France,BU 2,97.13,13.47,1308.67,48.50,1260.17,-7.22,-41.11,3.08,35.24,1270.19,979.20,20.78,270.21,260.19,16.57,33.33,210.29
4,5,2019-05-06,Customer ID 3,Customer group 1,Product ID 6,Product group 2,Italy,BU 2,35.36,13.90,491.51,13.71,477.80,-16.74,-9.90,1.64,4.77,498.02,363.21,9.22,125.60,105.37,12.39,6.52,86.46

#### 3.3. Display all rows

In [32]:
transactions

,row_id,transaction_date,customer_id,customer_level_2,product_id,product_level_2,geo,bu,volume,list_price,gross_sale,discount_placeholder,net_sale,other_ancillary_charge,freight_billed,payment_term_discount,off_invoice_discount,pocket_sale,cogs,other_cogs_adjustement,gross_margin,net_sale_gross_margin,freight_cost,other_cost_to_serve,net_margin
0,1,2019-06-04,Customer ID 7,Customer group 2,Product ID 9,Product group 2,Italy,BU 2,0.240000,15.050000,3.680000,0.070000,3.610000,-0.080000,0.000000,0.060000,0.030000,3.610000,2.520000,0.090000,1.000000,1.010000,0.030000,0.120000,0.860000
1,2,2019-08-31,Customer ID 1,Customer group 1,Product ID 1,Product group 1,Spain,BU 2,75.270000,12.670000,953.670000,3.530000,950.130000,-36.740000,-20.020000,21.870000,35.410000,949.620000,782.850000,25.050000,141.720000,142.240000,16.520000,5.270000,120.450000
2,3,2019-01-18,Customer ID 8,Customer group 2,Product ID 3,Product group 1,France,BU 2,49.100000,14.180000,696.440000,19.710000,676.730000,-3.010000,-11.930000,24.140000,20.240000,647.290000,514.160000,1.760000,131.370000,160.810000,18.060000,12.840000,129.910000
3,4,2019-05-09,Customer ID 1,Customer group 1,Product ID 6,Product group 2,France,BU 2,97.130000,13.470000,1308.670000,48.500000,1260.170000,-7.220000,-41.110000,3.080000,35.240000,1270.190000,979.200000,20.780000,270.210000,260.190000,16.570000,33.330000,210.290000
4,5,2019-05-06,Customer ID 3,Customer group 1,Product ID 6,Product group 2,Italy,BU 2,35.360000,13.900000,491.510000,13.710000,477.800000,-16.740000,-9.900000,1.640000,4.770000,498.020000,363.210000,9.220000,125.600000,105.370000,12.390000,6.520000,86.460000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
486,487,2019-07-31,Customer ID 7,Customer group 2,Product ID 4,Product group 1,Spain,BU 1,6.049488,11.686200,70.695526,1.301169,69.394358,-1.566860,-0.613685,2.418869,1.849535,67.306499,63.125155,2.717723,1.463621,3.551479,2.806810,1.621732,-0.877063
487,488,2019-04-14,Customer ID 8,Customer group 2,Product ID 4,Product group 1,France,BU 1,20.100172,12.396742,249.176649,9.785409,239.391240,-0.522519,-2.201590,9.753609,9.374083,222.987657,201.237424,5.801000,15.949233,32.352817,2.375629,3.671336,26.305852
488,489,2019-03-13,Customer ID 1,Customer group 1,Product ID 7,Product group 2,Spain,BU 1,20.045980,18.172022,364.275980,3.900166,360.375814,-9.133453,-6.975775,4.154290,1.221833,371.108918,201.602059,4.833381,164.673478,153.940373,3.867095,7.253203,142.820075
489,490,2019-07-09,Customer ID 9,Customer group 2,Product ID 7,Product group 2,France,BU 1,21.630340,18.555551,401.362883,3.359787,398.003096,-1.767901,-4.380322,0.717121,0.976311,402.457887,222.128693,0.797716,179.531477,175.076686,3.243194,0.984525,170.848968
490,491,2019-10-04,Customer ID 5,Customer group 1,Product ID 7,Product group 2,Italy,BU 1,86.025132,11.380394,978.999869,14.097807,964.902062,-2.324287,-17.260015,11.156296,33.683031,939.647038,901.467100,1.368410,36.811528,62.066552,30.418033,36.977356,-5.328837

#### 3.4. Quick statistic of numerical columns

In [33]:
transactions.describe()

,row_id,volume,list_price,gross_sale,discount_placeholder,net_sale,other_ancillary_charge,freight_billed,payment_term_discount,off_invoice_discount,pocket_sale,cogs,other_cogs_adjustement,gross_margin,net_sale_gross_margin,freight_cost,other_cost_to_serve,net_margin
count,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000,491.000000
mean,246.000000,49.521633,15.138969,750.220635,13.049522,737.171419,-12.072921,-11.916023,12.390689,12.496852,736.272272,506.599750,11.848288,217.824213,218.723136,12.222471,12.267445,194.233300
std,141.883755,30.060321,2.859172,482.970994,11.673997,475.609081,11.060515,11.051979,11.196713,11.116029,475.261343,307.476530,11.007428,212.577073,212.209721,11.023602,10.734286,203.884130
min,1.000000,0.090000,10.019153,1.590000,0.010000,1.580000,-49.920000,-46.530000,0.010000,0.010000,1.550000,0.960000,0.000000,-134.730000,-86.650000,0.030000,0.000000,-160.920000
25%,123.500000,22.550000,12.644382,342.085326,3.439658,333.979023,-18.750263,-18.489128,3.130000,3.550000,328.485000,230.090000,2.871637,49.741596,49.375684,3.216596,3.645127,32.330000
50%,246.000000,50.620000,15.240000,743.470000,9.800000,722.220000,-8.800000,-8.400000,8.810000,9.374083,720.760000,517.000000,8.080000,154.880000,155.360000,8.620000,9.140000,135.540000
75%,368.500000,74.330000,17.494211,1114.415000,20.635886,1098.765000,-2.599229,-2.692064,19.070000,19.158808,1100.117950,760.305512,18.735000,348.935000,346.273702,19.065000,18.517370,316.447679
max,491.000000,99.980000,19.960000,1972.132341,49.530000,1952.095845,-0.010000,0.000000,47.930000,49.170000,1910.080912,1045.150000,48.290000,878.656663,920.671595,48.869463,48.880000,859.682931

#### 3.5. Distinct values of a column

In [34]:
#
# count number of distinct values in a column
#
print(transactions["customer_id"].nunique())

10

In [35]:
#
# list of distinct values in a column
#
print(transactions["customer_id"].unique())

['Customer ID 7' 'Customer ID 1' 'Customer ID 8' 'Customer ID 3'
 'Customer ID 10' 'Customer ID 2' 'Customer ID 6' 'Customer ID 9'
 'Customer ID 4' 'Customer ID 5']

In [36]:
#
# list of distinct values in a column with their frequency
#
print(transactions["customer_id"].value_counts())

Customer ID 8     61
Customer ID 1     60
Customer ID 7     55
Customer ID 6     51
Customer ID 10    51
Customer ID 5     45
Customer ID 4     45
Customer ID 2     44
Customer ID 3     43
Customer ID 9     36
Name: customer_id, dtype: int64

### 4. Select data (select)
https://pandas.pydata.org/docs/user_guide/basics.html

#### 4.1. Display columns and types

In [37]:
transactions.dtypes

row_id                      int64
transaction_date           object
customer_id                object
customer_level_2           object
product_id                 object
product_level_2            object
geo                        object
bu                         object
volume                    float64
list_price                float64
gross_sale                float64
discount_placeholder      float64
net_sale                  float64
other_ancillary_charge    float64
freight_billed            float64
payment_term_discount     float64
off_invoice_discount      float64
pocket_sale               float64
cogs                      float64
other_cogs_adjustement    float64
gross_margin              float64
net_sale_gross_margin     float64
freight_cost              float64
other_cost_to_serve       float64
net_margin                float64
dtype: object

In [38]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 491 entries, 0 to 490
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   row_id                  491 non-null    int64
 1   transaction_date        491 non-null    object
 2   customer_id             491 non-null    object
 3   customer_level_2        491 non-null    object
 4   product_id              491 non-null    object
 5   product_level_2         491 non-null    object
 6   geo                     491 non-null    object
 7   bu                      491 non-null    object
 8   volume                  491 non-null    float64
 9   list_price              491 non-null    float64
 10  gross_sale              491 non-null    float64
 11  discount_placeholder    491 non-null    float64
 12  net_sale                491 non-null    float64
 13  other_ancillary_charge  491 non-null    float64
 14  freight_billed          491 non-null    float64
 15  payment_term_discount   491 non-null    float64
 16  off_invoice_discount    491 non-null    float64
 17  pocket_sale             491 non-null    float64
 18  cogs                    491 non-null    float64
 19  other_cogs_adjustement  491 non-null    float64
 20  gross_margin            491 non-null    float64
 21  net_sale_gross_margin   491 non-null    float64
 22  freight_cost            491 non-null    float64
 23  other_cost_to_serve     491 non-null    float64
 24  net_margin              491 non-null    float64
dtypes: float64(17), int64(1), object(7)
memory usage: 96.0+ KB

#### 4.2. Display number of rows

In [39]:
transactions.shape[0]

491

#### 4.3. Keep only a subset of columns

In [40]:
transactions_subset = transactions.copy()
transactions_subset = transactions_subset[['customer_id', 'product_id']]
transactions_subset.dtypes

customer_id    object
product_id     object
dtype: object

#### 4.4. Drop columns

In [41]:
transactions_drop = transactions.copy()
transactions_drop.drop(['row_id', 'geo', 'bu', 'customer_level_2', 'product_level_2'], axis=1, inplace=True)
transactions_drop.dtypes

transaction_date           object
customer_id                object
product_id                 object
volume                    float64
list_price                float64
gross_sale                float64
discount_placeholder      float64
net_sale                  float64
other_ancillary_charge    float64
freight_billed            float64
payment_term_discount     float64
off_invoice_discount      float64
pocket_sale               float64
cogs                      float64
other_cogs_adjustement    float64
gross_margin              float64
net_sale_gross_margin     float64
freight_cost              float64
other_cost_to_serve       float64
net_margin                float64
dtype: object

#### 4.5. Rename columns

In [42]:
transactions_rename = transactions.copy()
transactions_rename.rename(columns={'customer_level_2':'customer_category', 'product_level_2':'product_category'}, inplace=True)
transactions_rename.dtypes

row_id                      int64
transaction_date           object
customer_id                object
customer_category          object
product_id                 object
product_category           object
geo                        object
bu                         object
volume                    float64
list_price                float64
gross_sale                float64
discount_placeholder      float64
net_sale                  float64
other_ancillary_charge    float64
freight_billed            float64
payment_term_discount     float64
off_invoice_discount      float64
pocket_sale               float64
cogs                      float64
other_cogs_adjustement    float64
gross_margin              float64
net_sale_gross_margin     float64
freight_cost              float64
other_cost_to_serve       float64
net_margin                float64
dtype: object

### 4.6. Add columns

In [61]:
customers_add_columns = customers.copy()

# adding a new column to form a unique city name

customers_add_columns["unique_city"] = customers_add_columns["country"] + "-" + customers_add_columns["city"]

customers_add_columns

      customer_id   customer_name phone_nbr country       city   unique_city
0   Customer ID 7  customer_seven  00321234      BE  Bruxelles  BE-Bruxelles
1   Customer ID 1    customer_one      5678      BE  Bruxelles  BE-Bruxelles
2   Customer ID 8  customer_eight      0123      BE      Wavre      BE-Wavre
3   Customer ID 3  customer_three      0441      BE      Lille      BE-Lille
4  Customer ID 10    customer_ten  00329086      BE      Namur      BE-Namur
5   Customer ID 2    customer_two      9812      BE  Charleroi  BE-Charleroi
6   Customer ID 6    customer_six      6413      FR      Paris      FR-Paris
7   Customer ID 9   customer_nine  00338792      FR      Lille      FR-Lille
8   Customer ID 4   customer_four      4392      FR    Roubaix    FR-Roubaix
9   Customer ID 5   customer_five      4724      FR     Toulon     FR-Toulon

#### 4.7. Change data type

In [43]:
transactions_type = transactions.copy()

#To text
transactions_type['row_id'] = transactions_type['row_id'].astype(str)
transactions_type.dtypes

#To number
transactions_type['row_id'] = pd.to_numeric(transactions_type['row_id'], errors='coerce')
transactions_type.dtypes

#To date
transactions_type['transaction_date'] = pd.to_datetime(transactions_type['transaction_date'])
transactions_type.dtypes

row_id                             int64
transaction_date          datetime64[ns]
customer_id                       object
customer_level_2                  object
product_id                        object
product_level_2                   object
geo                               object
bu                                object
volume                           float64
list_price                       float64
gross_sale                       float64
discount_placeholder             float64
net_sale                         float64
other_ancillary_charge           float64
freight_billed                   float64
payment_term_discount            float64
off_invoice_discount             float64
pocket_sale                      float64
cogs                             float64
other_cogs_adjustement           float64
gross_margin                     float64
net_sale_gross_margin            float64
freight_cost                     float64
other_cost_to_serve              float64
net_margin                       float64
dtype: object

### 5. Transpose (transpose)
https://pandas.pydata.org/docs/user_guide/reshaping.html#reshaping-by-melt

Pivots the orientation of the data so that horizontal fields are moved on the vertical axis

In [44]:
# the costs dataset contains one column per month for product price in different geography:
print(costs.info())
costs.head(n=5)

costs_transpose = pd.melt(costs, id_vars=['product_id','geo'], value_vars=['2019-01','2019-02','2019-03','2019-04','2019-05','2019-06','2019-07','2019-09','2019-10','2019-11','2019-12','2020-01'])
costs_transpose.rename(columns={'variable':'year_month'}, inplace=True)
costs_transpose.rename(columns={'value':'average_unit_cost'}, inplace=True)

print(costs_transpose.info())
costs_transpose.head(n=5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   product_id  40 non-null     object
 1   geo         40 non-null     object
 2   2019-01     27 non-null     float64
 3   2019-02     26 non-null     float64
 4   2019-03     24 non-null     float64
 5   2019-04     29 non-null     float64
 6   2019-05     22 non-null     float64
 7   2019-06     27 non-null     float64
 8   2019-07     25 non-null     float64
 9   2019-09     28 non-null     float64
 10  2019-10     26 non-null     float64
 11  2019-11     24 non-null     float64
 12  2019-12     28 non-null     float64
 13  2020-01     3 non-null      float64
dtypes: float64(12), object(2)
memory usage: 4.5+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 480 entries, 0 to 479
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   product_id         480 non-null    object
 1   geo                480 non-null    object
 2   year_month         480 non-null    object
 3   average_unit_cost  289 non-null    float64
dtypes: float64(1), object(3)
memory usage: 15.1+ KB
None

     product_id      geo year_month  average_unit_cost
0  Product ID 1  Belgium    2019-01              10.45
1  Product ID 1   France    2019-01              20.36
2  Product ID 1    Italy    2019-01              20.90
3  Product ID 1    Spain    2019-01                NaN
4  Product ID 2  Belgium    2019-01                NaN

In [45]:
#
# if you do not want to type the list of columns to pivot, you can build it from the definition of the dataframe:
#

# get the list of columns as a Python list
costs_columns_to_pivot = list(costs.columns)

# remove the columns we want to retain as is
costs_columns_to_pivot.remove("product_id")
costs_columns_to_pivot.remove("geo")
print(costs_columns_to_pivot)

# transpose
costs_transpose_2 = pd.melt(costs, id_vars=['product_id','geo'], value_vars=costs_columns_to_pivot)
costs_transpose_2.rename(columns={'variable':'year_month'}, inplace=True)
costs_transpose_2.rename(columns={'value':'average_unit_cost'}, inplace=True)

# check results
print(costs_transpose_2.info())
costs_transpose_2.head(n=5)

['2019-01', '2019-02', '2019-03', '2019-04', '2019-05', '2019-06', '2019-07', '2019-09', '2019-10', '2019-11', '2019-12', '2020-01']
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 480 entries, 0 to 479
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   product_id         480 non-null    object
 1   geo                480 non-null    object
 2   year_month         480 non-null    object
 3   average_unit_cost  289 non-null    float64
dtypes: float64(1), object(3)
memory usage: 15.1+ KB
None

     product_id      geo year_month  average_unit_cost
0  Product ID 1  Belgium    2019-01              10.45
1  Product ID 1   France    2019-01              20.36
2  Product ID 1    Italy    2019-01              20.90
3  Product ID 1    Spain    2019-01                NaN
4  Product ID 2  Belgium    2019-01                NaN

### 6. Merge datasets (join)
https://pandas.pydata.org/docs/user_guide/merging.html#database-style-dataframe-or-named-series-joining-merging

#### 6.1. Examples of joins supported by the pandas merge() function

The examples use two small dataframes (left_source_df and right_source_df) The join key is stored in a column named 'column_join' in both datasets, but this is not required. The merge() function will update the name of columns present in both datasets that are not part of the join key. For left join, right join and outer join, the merge() function sets missing values to NaN.

In [47]:
left_source_df = pd.DataFrame({"column_join": ["A","B","C"], "column_b": ["X1","Y1","W1"], "column_c":[111,222,333]})
right_source_df = pd.DataFrame({"column_join": ["A","B","D"], "column_b": ["X2","Y2","Z2"], "column_d":[444,555,666]})

print("\nLeft source")
print(left_source_df)

print("\nRight source")
print(right_source_df)

print("\nExample inner join")
example_inner = pd.merge(left_source_df, right_source_df, 
                         how='inner', 
                         left_on=['column_join'], 
                         right_on=['column_join'], 
                         suffixes=('_LEFT', '_RIGHT'))
print(example_inner)

print("\nExample left join")
example_left = pd.merge(left_source_df, right_source_df, 
                        how='left', left_on=['column_join'], 
                        right_on=['column_join'], 
                        suffixes=('_LEFT', '_RIGHT'))
print(example_left)

print("\nExample right join")
example_right = pd.merge(left_source_df, right_source_df, 
                         how='right', 
                         left_on=['column_join'], 
                         right_on=['column_join'], 
                         suffixes=('_LEFT', '_RIGHT'))
print(example_right)

print("\nExample outer join")
example_outer = pd.merge(left_source_df, right_source_df, 
                         how='outer', 
                         left_on=['column_join'], 
                         right_on=['column_join'], 
                         suffixes=('_LEFT', '_RIGHT'))
print(example_outer)

Left source
  column_join column_b  column_c
0           A       X1       111
1           B       Y1       222
2           C       W1       333

Right source
  column_join column_b  column_d
0           A       X2       444
1           B       Y2       555
2           D       Z2       666

Example inner join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d
0           A            X1       111             X2       444
1           B            Y1       222             Y2       555

Example left join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d
0           A            X1       111             X2     444.0
1           B            Y1       222             Y2     555.0
2           C            W1       333            NaN       NaN

Example right join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d
0           A            X1     111.0             X2       444
1           B            Y1     222.0             Y2       555
2           D           NaN       NaN             Z2       666

Example outer join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d
0           A            X1     111.0             X2     444.0
1           B            Y1     222.0             Y2     555.0
2           C            W1     333.0            NaN       NaN
3           D           NaN       NaN             Z2     666.0

#### 6.2. Using information returned by merge() to run right_only and left_only joins

In [48]:
# the merge() function can add a column with the source of the data (left_only, right_only, both) 
# by default, this column is named "_merge"
# we can apply a filter on this column to retain only rows available in left data source, right data source or both.

print("\nExample outer join with indicator")
example_outer_with_indicator = pd.merge(left_source_df, right_source_df, indicator=True, how='outer', left_on=['column_join'], right_on=['column_join'], suffixes=('_LEFT', '_RIGHT'))
print(example_outer_with_indicator)

print("\nExample left only join")
example_left_only = pd.merge(left_source_df, right_source_df, indicator=True, how='left', left_on=['column_join'], right_on=['column_join'], suffixes=('_LEFT', '_RIGHT'))
example_left_only = example_left_only[example_left_only["_merge"] == "left_only"]
print(example_left_only)

print("\nExample right only join")
example_right_only = pd.merge(left_source_df, right_source_df, indicator=True, how='right', left_on=['column_join'], right_on=['column_join'], suffixes=('_LEFT', '_RIGHT'))
example_right_only = example_right_only[example_right_only["_merge"] == "right_only"]
print(example_right_only)

Example outer join with indicator
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d      _merge
0           A            X1     111.0             X2     444.0        both
1           B            Y1     222.0             Y2     555.0        both
2           C            W1     333.0            NaN       NaN   left_only
3           D           NaN       NaN             Z2     666.0  right_only

Example left only join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d     _merge
2           C            W1       333            NaN       NaN  left_only

Example right only join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d      _merge
2           D           NaN       NaN             Z2       666  right_only

In [49]:
#
# we can, of course, extract the three subsets from the results of our outer join with indicator
#
example_outer_left_only = example_outer_with_indicator[example_outer_with_indicator["_merge"] == "left_only"]
example_outer_right_only = example_outer_with_indicator[example_outer_with_indicator["_merge"] == "right_only"]
example_outer_common_only = example_outer_with_indicator[example_outer_with_indicator["_merge"] == "both"]

print("\nExample right only from outer join")
print(example_outer_left_only)

print("\nExample right only from outer join")
print(example_outer_right_only)

print("\nExample common only from outer join")
print(example_outer_common_only)

Example right only from outer join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d     _merge
2           C            W1     333.0            NaN       NaN  left_only

Example right only from outer join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d      _merge
3           D           NaN       NaN             Z2     666.0  right_only

Example common only from outer join
  column_join column_b_LEFT  column_c column_b_RIGHT  column_d _merge
0           A            X1     111.0             X2     444.0   both
1           B            Y1     222.0             Y2     555.0   both

#### 6.3. Data preparation for examples based on our transaction data

<div class="alert alert-block alert-danger">
For the merge code snippets to work, make sure to run first the transpose code snippet to generate the "costs_transpose" dataset, and also run the snippet here under to generate the "transactions_enriched" dataset 
</div>

In [50]:
transactions_enriched = transactions.copy()
transactions_enriched['transaction_date'] = transactions_enriched['transaction_date'].astype(str)
transactions_enriched['year_month'] = transactions_enriched['transaction_date'].str[:7]
transactions_enriched[['transaction_date', 'year_month']]

    transaction_date year_month
0         2019-06-04    2019-06
1         2019-08-31    2019-08
2         2019-01-18    2019-01
3         2019-05-09    2019-05
4         2019-05-06    2019-05
..               ...        ...
486       2019-07-31    2019-07
487       2019-04-14    2019-04
488       2019-03-13    2019-03
489       2019-07-09    2019-07
490       2019-10-04    2019-10

[491 rows x 2 columns]

#### 6.3. Running an inner join on our transaction data

In [51]:
merge_inner = pd.merge(transactions_enriched, costs_transpose, how='inner', left_on=['product_id', 'geo', 'year_month'], right_on=['product_id', 'geo', 'year_month'], suffixes=('_LEFT', '_RIGHT'))
merge_inner.info()

print(f"Nunmber of rows in transaction data {transactions_enriched.shape[0]}")
print(f"Number of rows in merged dataset: {merge_inner.shape[0]}")

<class 'pandas.core.frame.DataFrame'>
Int64Index: 400 entries, 0 to 399
Data columns (total 27 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   row_id                  400 non-null    int64
 1   transaction_date        400 non-null    object
 2   customer_id             400 non-null    object
 3   customer_level_2        400 non-null    object
 4   product_id              400 non-null    object
 5   product_level_2         400 non-null    object
 6   geo                     400 non-null    object
 7   bu                      400 non-null    object
 8   volume                  400 non-null    float64
 9   list_price              400 non-null    float64
 10  gross_sale              400 non-null    float64
 11  discount_placeholder    400 non-null    float64
 12  net_sale                400 non-null    float64
 13  other_ancillary_charge  400 non-null    float64
 14  freight_billed          400 non-null    float64
 15  payment_term_discount   400 non-null    float64
 16  off_invoice_discount    400 non-null    float64
 17  pocket_sale             400 non-null    float64
 18  cogs                    400 non-null    float64
 19  other_cogs_adjustement  400 non-null    float64
 20  gross_margin            400 non-null    float64
 21  net_sale_gross_margin   400 non-null    float64
 22  freight_cost            400 non-null    float64
 23  other_cost_to_serve     400 non-null    float64
 24  net_margin              400 non-null    float64
 25  year_month              400 non-null    object
 26  average_unit_cost       400 non-null    float64
dtypes: float64(18), int64(1), object(8)
memory usage: 87.5+ KB
Nunmber of rows in transaction data 491
Number of rows in merged dataset: 400

We are loosing transaction records because the merge() function cannot find corresponding cost information. What we need here is a left join, something similat to a VLookup() in Excel

#### 6.4. Running a left join ( VLookup() ) on our transaction data

In [53]:
# Since the column names are identical in both dataframes, we can used a simplified version:

merge_left = pd.merge(transactions_enriched, costs_transpose,
                      indicator=True,
                      how='left', 
                      on=['product_id', 'geo', 'year_month'], 
                      suffixes=('_LEFT', '_RIGHT'))

merge_left.info()

print(f"Nunmber of rows in transaction data {transactions_enriched.shape[0]}")
print(f"Number of rows in merged dataset: {merge_left.shape[0]}")

transactions_without_costs = merge_left[merge_left["_merge"] == "left_only"]
print(f"Number of transaction rows without costs: {transactions_without_costs.shape[0]}")

<class 'pandas.core.frame.DataFrame'>
Int64Index: 491 entries, 0 to 490
Data columns (total 28 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   row_id                  491 non-null    int64
 1   transaction_date        491 non-null    object
 2   customer_id             491 non-null    object
 3   customer_level_2        491 non-null    object
 4   product_id              491 non-null    object
 5   product_level_2         491 non-null    object
 6   geo                     491 non-null    object
 7   bu                      491 non-null    object
 8   volume                  491 non-null    float64
 9   list_price              491 non-null    float64
 10  gross_sale              491 non-null    float64
 11  discount_placeholder    491 non-null    float64
 12  net_sale                491 non-null    float64
 13  other_ancillary_charge  491 non-null    float64
 14  freight_billed          491 non-null    float64
 15  payment_term_discount   491 non-null    float64
 16  off_invoice_discount    491 non-null    float64
 17  pocket_sale             491 non-null    float64
 18  cogs                    491 non-null    float64
 19  other_cogs_adjustement  491 non-null    float64
 20  gross_margin            491 non-null    float64
 21  net_sale_gross_margin   491 non-null    float64
 22  freight_cost            491 non-null    float64
 23  other_cost_to_serve     491 non-null    float64
 24  net_margin              491 non-null    float64
 25  year_month              491 non-null    object
 26  average_unit_cost       400 non-null    float64
 27  _merge                  491 non-null    category
dtypes: category(1), float64(18), int64(1), object(8)
memory usage: 108.0+ KB
Nunmber of rows in transaction data 491
Number of rows in merged dataset: 491
Number of transaction rows without costs: 91

#### 6.4. Running a right-only join to find product without any transactions

In [54]:
# All columns from the transaction dataset will be set to NaN, so we retain only the columns used as key

 
merge_right_only = pd.merge(transactions_enriched[['product_id', 'geo', 'year_month']], costs_transpose, 
                            indicator=True, 
                            how='right', 
                            on=['product_id', 'geo', 'year_month'], 
                            suffixes=('_LEFT', '_RIGHT'))

merge_right_only = merge_right_only[merge_right_only["_merge"] == "right_only"]

merge_right_only

        product_id      geo year_month  average_unit_cost      _merge
5     Product ID 1    Spain    2019-01                NaN  right_only
6     Product ID 2  Belgium    2019-01                NaN  right_only
7     Product ID 2   France    2019-01                NaN  right_only
10    Product ID 2    Spain    2019-01                NaN  right_only
16    Product ID 3    Spain    2019-01                NaN  right_only
..             ...      ...        ...                ...         ...
620   Product ID 9    Spain    2020-01                NaN  right_only
621  Product ID 11  Belgium    2020-01              10.27  right_only
622  Product ID 11   France    2020-01                NaN  right_only
623  Product ID 11    Italy    2020-01                NaN  right_only
624  Product ID 11    Spain    2020-01                NaN  right_only

[225 rows x 5 columns]

### xx. Row by row transformations

In some cases, we need to run some code for each row. Here is a simple example.

In [55]:
customers_copy = customers.copy()
#
# for this example, we add the country code as a prefix to the phone number if the prefix is not yet there
# there are a lot of things that can go wrong and are not covered hereunder.
#

for row_number, row_data in customers_copy.iterrows():
   
    phone_nbr = row_data["phone_nbr"]
    country = row_data["country"]
    
    
    if country == "BE":
        prefix = "0032"
    elif country == "FR":
        prefix = "0033"
    else:
        prefix = ""
        
# update the dataframe, as required

    if len(prefix) > 0 and phone_nbr[0:4] != prefix:
        new_phone_nbr = prefix + phone_nbr
        customers_copy.loc[row_number,"phone_nbr"] = new_phone_nbr

print(customers_copy)

      customer_id   customer_name phone_nbr country
0   Customer ID 7  customer_seven  00321234      BE
1   Customer ID 1    customer_one  00325678      BE
2   Customer ID 8  customer_eight  00320123      BE
3   Customer ID 3  customer_three  00320441      BE
4  Customer ID 10    customer_ten  00329086      BE
5   Customer ID 2    customer_two  00329812      BE
6   Customer ID 6    customer_six  00336413      FR
7   Customer ID 9   customer_nine  00338792      FR
8   Customer ID 4   customer_four  00334392      FR
9   Customer ID 5   customer_five  00334724      FR

### Write data (outputdata)
https://pandas.pydata.org/docs/user_guide/io.html

#### Write to csv

In [ ]:
transactions.to_csv('data_output/transactions_output.csv', sep=',', header=True, index=False, encoding='utf-8')

#### Write to xlsx

In [ ]:
merge_inner.to_excel('data_output/merge.xlsx', sheet_name='merge_inner', index=False)